import React from 'react';

const HowToUse = () => {
    return (
        <React.Fragment>
            <h1>chot.HELPとは？</h1>
            <p>困っている人とスキルがある人を謝礼と評価でマッチングするサービスです</p>
            <h1>こんなことはありませんか？</h1>
            <h2>問題が解決しない</h2>
            <p>右も左もわからず、ググり方もわからない、身近に頼れる人もいない</p>
            <p>開発環境依存の謎エラーやアーキテクチャー設計などググっても解決しない問題を抱えている</p>
            <p>TwitterやStackOverflowで質問したが回答がもらえない、もらえても的確なものでない</p>
            <h2>人助けのモチベが続かない</h2>
            <p>人に何か教えるのは嫌いではないが、業務でもないのに進んでやるほどではない</p>
            <p>親切心で初学者に手を差し伸べたけど、質問が要領を得ないので何が起きているのか把握できない</p>
            <p>Twitterで質問があったので回答したが、やりとりが長期化してきた</p>
            <h1>chot.HELPなら</h1>
            <h2>スムーズに問題が解決する</h2>
            <p>スキルのある人が時間いっぱい全力で助けてくれるので、問題が解決しやすい</p>
            <p>相手の評価を確認してから問題の解決を依頼できるので、依頼に失敗しにくい</p>
            <p>口頭でやりとりするので、状況の伝達やラフな質問が可能で、問題が解決に向かう</p>
            <h2>モチベ高く人助けできる</h2>
            <p>謝礼がもらえるので、やる気が下がりにくい</p>
            <p>口頭でやりとりするので、認識の齟齬が発生しにくく、やりとりもスムーズに進む</p>
            <p>時間が決まっているので、拘束時間が想定より多くなることを避けられる</p>
            <h1>chot.HELPの使い方</h1>
            <h2>1. 時間と謝礼を設定して請負人を募集</h2>
            <h2>2. 請負人に応募</h2>
            <h2>3. 候補者から1人を請負人に選択</h2>
            <h2>マッチング成立</h2>
            <h2>4. 一緒にZoomやMeetで問題を解決</h2>
            <h2>5. 決められた時間が経過したらマッチング終了</h2>
            <h2>6. お互いを評価</h2>
            <h2>7. 謝礼が届く</h2>
        </React.Fragment>
    )
}

export default HowToUse